@echo off
Mode con Cols=70 Lines=8

title Pendu By Orion 

echo ллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллл
echo л   лллллллл    лллллллл  лллл лллллл    лллллллллл лллл лллллллллллл
echo л лл ллллллл ллллллллллл л ллл лллллл ллл ллллллллл лллл лллллллллллл
echo л   лллллллл   ллллллллл лл лл лллллл ллл ллллллллл лллл лллллллллллл
echo л лллллллллл ллллллллллл ллл л лллллл ллл ллллллллл лллл лллллллллллл
echo л лллллллллл    лллллллл лллл  лллллл    ллллллллллл    ллBy Orionллл
echo ллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллл

color FA

choice /T 1 /D o > NUL

color FB

choice /T 1 /D o > NUL

color FC

choice /T 1 /D o > NUL

color Fd

choice /T 1 /D o > NUL

pause 
start menu 
exit

